In [1]:
import pandas as pd
import numpy as np
from sklearn.tree import DecisionTreeClassifier

### Загрузите выборку из файла titanic.csv с помощью пакета Pandas.

In [2]:
data = pd.read_csv('titanic.csv')
data.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

### Оставьте в выборке четыре признака: класс пассажира (Pclass), цену билета (Fare), возраст пассажира (Age) и его пол (Sex).

In [3]:
data = data[['Pclass','Fare','Age','Sex','Survived']]
data.head()

   Pclass     Fare   Age     Sex  Survived
0       3   7.2500  22.0    male         0
1       1  71.2833  38.0  female         1
2       3   7.9250  26.0  female         1
3       1  53.1000  35.0  female         1
4       3   8.0500  35.0    male         0

### Обратите внимание, что признак Sex имеет строковые значения.

In [4]:
data['Sex'] = data['Sex'].replace(['male','female'],[1,0])
data.head()

   Pclass     Fare   Age  Sex  Survived
0       3   7.2500  22.0    1         0
1       1  71.2833  38.0    0         1
2       3   7.9250  26.0    0         1
3       1  53.1000  35.0    0         1
4       3   8.0500  35.0    1         0

### В данных есть пропущенные значения — например, для некоторых пассажиров неизвестен их возраст. Такие записи при чтении их в pandas принимают значение nan. Найдите все объекты, у которых есть пропущенные признаки, и удалите их из выборки.

In [5]:
data.isna().any().any()

True

In [6]:
data = data.dropna()
data.isna().any().any()

False

### Выделите целевую переменную — она записана в столбце Survived.

In [7]:
X = data.drop(columns=['Survived'],axis=1)
y = data['Survived']

### Обучите решающее дерево с параметром random_state=241 и остальными параметрами по умолчанию (речь идет о параметрах конструктора DecisionTreeСlassifier).

In [8]:
model_dtc = DecisionTreeClassifier(random_state = 241)
model_dtc.fit(X,y)

DecisionTreeClassifier(random_state=241)

### Вычислите важности признаков и найдите два признака с наибольшей важностью. Их названия будут ответами для данной задачи (в качестве ответа укажите названия признаков через запятую или пробел, порядок не важен).

In [9]:
features_import = model_dtc.feature_importances_
df = pd.Series(features_import, index=X.columns).sort_values(ascending=False)
df

Fare      0.303436
Sex       0.300512
Age       0.256046
Pclass    0.140005
dtype: float64